

# What is BDD?
<p dir="rtl">
چرخه توسعه نرم‌افزار، چرخه‌ای است که می‌تواند با فرآیندهای زیادی همراه باشد و این به معنی اتلاف هزینه و زمان برای توسعه‌دهندگان  است. عدم ارتباط صحیح میان تیم‌های مختلف در توسعه محصول، می‌تواند باعث شود که نیاز بازار به صورت صحیح برآورده نشود و این مسئله می‌تواند گلوگاهی برای توسعه صحیح نرم‌افزار باشد.
این  عدم ارتباط ممکن است  منجر به تولید محصولی شود که از دیدگاه فنی functional باشد ولی نتوانسته باشد دقیقا نیازهای بازار را برآورده کند. روش Behavior Driven Development برای بهبود این مسئله ایجاد شده است.<p>

<p dir="rtl">تعریف BDD:<p>
<p dir="rtl">
"BDD فرآیندی است که برای کمک به مدیریت و ارائه پروژه‌های توسعه نرم‌افزار، با بهبود ارتباطات بین مهندسان و متخصصان تجارت طراحی شده است. با این کار، BDD تضمین می‌کند که تمام پروژه‌های توسعه بر آنچه که کسب‌وکار واقعاً به آن نیاز دارد تمرکز می‌کند و  تمام نیازهای کاربر را برآورده می‌کند."<br>
برای آشنایی  بیشتر در مورد روش BDD می‌توانید لینک های زیر را بخوانید:<br>
<a href="https://inviqa.com/blog/bdd-guide">BDD</a><br>
<a href="https://www.techtarget.com/searchsoftwarequality/definition/Behavior-driven-development-BDD">BDD-more</a>
<p>

# BDD & Agile
<p dir="rtl">توسعه رفتار محور(BDD)، نحوه توسعه Agile  را تحت تاثیر قرار نمی‌دهد ولی آن را بهبود میدهد. BDD  این امکان را به شما میدهد تا بتوانید اهداف agile را بهتر پیاده کنید. (BDD جایگزین Agile نمیشود)<p>


# Rapid iteration
<p dir="rtl">روش  BDD یک فعالیت سه مرحلهای تکرار پذیر شامل مراحل زیر است:<br>
1-یک User Story را در نظر بگیرید و در مورد نمونه‌های عینی از function جدید گفتگو کنید تا بتوانید درباره چیزی که انتظار می‌رود انجام شود به نتیجه‌ای برسید و توافق کنید.<br>
2-سپس نمونه‌ها را به روشی که پاسخگوی نیازمندی‌ها باشد، مستندسازی کنید.<br>
3- در آخر عملکرد  توصیف شده در مستند را بر اساس نمونه‌ها  پیاده‌سازی کنید.  در این روش از یک تست خودکار به عنوان راهنما استفاده می‌کنیم، توسعه دهنده باید بتواند این تست را pass کند.<br>
ایده اصلی این نوع توسعه، این است که هر تغییر را کوچک کنید و آن را به سرعت تکرار کنید و هربار که اطلاعات بیشتری نیاز دارید به یک لایه بالاتر بروید. هر بار که شما یک مثال (تست) را پیاده سازی و خودکار می‌کنید.</p>

![Rapid iteration](https://dev-wishdesk.s3.eu-west-3.amazonaws.com/s3fs-public/inline-images/itterative-design-process.jpg) 

<p dir="rtl">در طول زمان تستهای مستند شده، تبدیل به یک گنجینه  می شود که به تیم شما اجازه می‌دهد بتواند سریع و با اطمینان بالا تغییراتی را در نرم‌افزار  ایجاد کند.<br>کدها نشان‌دهنده‌ی نحوه‌ی مستندسازی محصول است و همچنین مستندها نشان‌دهنده ی درک مشترک تیم از نیاز مشتری است.<br>
<span style="font-weight: bold">Discovery : آنچه محصول میتواند انجام دهد.</span><br>
سخت ترین بخش ساخت نرم افزار این است که تصمیم بگیریم دقیقا چه چیزی بسازیم. <br>
<p dir="ltr">– Fred Brooks, The mythical man-month</p>
<p dir="rtl">برای فهم بهتر نیازمندی‌های سمت کاربر، از گفتگوهای ساختارمندی به نام Discovery Workshop  استفاده می‌کنیم این جلسات روی مثال‌های واقعی از محصول از دید کاربر تمرکز دارد.<br>
این جلسات بر افزایش فهم مشترک از موارد زیر تمرکز دارد:<br>

* نیازمندی کاربرنهایی 
* قواعدی که طبق آن محصول باید کار کند.
*  دید نسبت به scope آنچه در نرم‌افزار باید انجام شود.

<p dir="rtl">
این کار، باعث سرعت بخشیدن به فرآیند توسعه و ارزشمندی بیشتر محصول می‌شود. زیرا باعث کاهش حداکثری زمان جلسات می‌شود.<br>اگر BDD برای شما مفهومی جدید است از مرحله Discovery  شروع کنید.<br>
<span style="font-weight: bold">Formulation : آنچه محصول باید انجام دهد 
</span><br>
هنگامی که نمونه‌ای  ارزشمند در قسمت Discovery  پیدا کردیم، وارد بخش Formulation  میشویم. در این بخشنمونه‌ها  تبدیل به یک مستند ساختارمند می‌شود. این کار به ما کمک می‌کند متوجه شویم که آیا واقعا به دیدی مشترک از آنچه باید بسازیم رسیده‌ایم یا خیر. این‌گونه می‌توانیم اگر اختلافی در دیدگاه‌ها وجود دارد، هنگام  نوشتن مستند برطرف کنیم. 
<span style="font-weight: bold">Formulation : Automation(خودکارسازی): آنچه محصول واقعا انجام می دهد
</span><br>
حالا که ما مشخصات قابل پیاده سازی را داریم می توانیم از آن ها در جهت راهنمایی برای توسعه محصول استفاده کنیم.



